electricalhog/PD_Charger/STM32CubeIDE/final/Core/Src/regulator.c
    /* --- Apply forced-HIGH to the static leg for the selected mode --- */
    if (regulator_mode == REGULATOR_MODE_BUCK)
    {
        hrtim_apply_buck_mode_static_leg();
    }
    else
    {
        hrtim_apply_boost_mode_static_leg();
    }

    /* --- Enable power path GPIOs --- */
    power_path_enable();

    /* --- Enable HRTIM switching outputs for the active leg (§5.5) --- */
    if (regulator_mode == REGULATOR_MODE_BUCK)
    {
        /* Enable Timer A outputs (CHA1/CHA2 = input-side switching leg) */
        HAL_HRTIM_WaveformOutputStart(&hhrtim1,
                                       HRTIM_OUTPUT_TA1 | HRTIM_OUTPUT_TA2);
        /* Enable Timer B outputs (CHB1/CHB2 = output-side static leg) */
        HAL_HRTIM_WaveformOutputStart(&hhrtim1,
                                       HRTIM_OUTPUT_TB1 | HRTIM_OUTPUT_TB2);
    }
    else /* BOOST */
    {
        /* Enable Timer B outputs (CHB1/CHB2 = output-side switching leg) */
        HAL_HRTIM_WaveformOutputStart(&hhrtim1,
                                       HRTIM_OUTPUT_TB1 | HRTIM_OUTPUT_TB2);
        /* Enable Timer A outputs (CHA1/CHA2 = input-side static leg) */
        HAL_HRTIM_WaveformOutputStart(&hhrtim1,
                                       HRTIM_OUTPUT_TA1 | HRTIM_OUTPUT_TA2);
    }

    /* --- Initialise slope compensation and start TIM6 --- */
    uint32_t v_out_mv = (uint32_t)adc_measurements.v_out_mv;
    slope_comp_update_step(v_out_mv, v_in_mv,
                            (SlopeCompMode)regulator_mode);
    slope_comp_start(0u);   /* peak starts at 0; ramps up with soft-start */

    /* --- Start PID timer (TIM7) --- */
    HAL_TIM_Base_Start_IT(&htim7);

    regulator_state = REGULATOR_STATE_RUNNING;
}

/* =========================================================================
 * regulator_stop
 * =========================================================================*/

void regulator_stop(void)
{
    /* Disable all HRTIM switching outputs immediately (§11.3) */
    hrtim_disable_all_outputs();

    /* Stop slope compensation and zero DAC */
    slope_comp_stop();

    /* Stop PID timer */
    HAL_TIM_Base_Stop_IT(&htim7);

    /* Disable power path */
    power_path_disable();

    /* Reset soft-start state */
    softstart_active      = false;
    softstart_setpoint_mv = 0u;

    /* Reset PID integrator for clean restart */
    pid_reset_integrator(&pid_state);

    regulator_state = REGULATOR_STATE_IDLE;
}

/* =========================================================================
 * regulator_clear_fault
 * =========================================================================*/

void regulator_clear_fault(void)
{
    if (regulator_state != REGULATOR_STATE_FAULT)
    {
        return;
    }

    /* Verify hardware fault inputs are deasserted (§4.4).
     * FLT1 (VS_GOOD) and FLT2 (IS_GOOD) are active-low; a GPIO read HIGH
     * means the fault has cleared.
     *
     * TODO(hardware): Verify GPIO read direction and polarity against
     * schematic during bring-up.  The HRTIM fault latches must also be
     * cleared via the HRTIM_ICR register before re-enabling outputs.
     */
    GPIO_PinState vs_good = HAL_GPIO_ReadPin(PIN_VS_GOOD_PORT, PIN_VS_GOOD_PIN);
    GPIO_PinState is_good = HAL_GPIO_ReadPin(PIN_IS_GOOD_PORT, PIN_IS_GOOD_PIN);

    if (vs_good == GPIO_PIN_RESET || is_good == GPIO_PIN_RESET)
    {
        /* Hardware fault is still asserted — cannot clear */
        return;
    }

    /* Clear HRTIM fault interrupt flags */
    HRTIM1->sCommonRegs.ICR = HRTIM_ICR_FLT1C | HRTIM_ICR_FLT2C;

    /* Reset regulator state */
    pid_reset_integrator(&pid_state);
    regulator_integrator_reset_requested = false;
    regulator_last_fault_source          = REGULATOR_FAULT_NONE;
    consecutive_backstop_count           = 0u;
    regulator_fault                      = false;

    regulator_state = REGULATOR_STATE_IDLE;
}

/* =========================================================================
 * regulator_set_target_voltage
 * =========================================================================*/

void regulator_set_target_voltage(uint32_t voltage_mv)
{
    pd_interface_notify_voltage_contract(voltage_mv);
}

/* =========================================================================
 * regulator_get_state / regulator_get_mode
 * =========================================================================*/

RegulatorState regulator_get_state(void)
{
    return regulator_state;
}

RegulatorMode regulator_get_mode(void)
{
    return regulator_mode;
}

/* =========================================================================
 * ISR bodies
 * =========================================================================*/

/**
 * regulator_hrtim_tima_period_isr — HRTIM Timer A period (REP) ISR.
 *
 * Fires at every switching period reset (200 kHz at default settings).
 * Reloads DAC3 CH1 with the PID peak value (§7.6).
 * Counts CMP1 backstop events (§10.4).
 *
 * Priority: NVIC_PRIORITY_HRTIM (1) — below TIM6 (0), above TIM7 (2).
 * No FreeRTOS API calls allowed.
 */
void regulator_hrtim_tima_period_isr(void)
{
    if (regulator_state != REGULATOR_STATE_RUNNING)
    {
        return;
    }

    /* Check if this period reset was caused by the Compare 1 backstop.
     * We distinguish by checking the HRTIM Timer A interrupt status register:
     *   - REP flag (bit 0) = period/repetition interrupt
     *   - CMP1 flag (bit 4) = compare 1 match interrupt
     *
     * TODO(hardware): Wire CMP1 interrupt properly.  For now, backstop
     * counting is a TODO pending hardware verification that CMP1 fires
     * correctly.  See §10.3.
     */

    /* Reload DAC3 CH1 with current PID peak value.
     * Must happen before the blanking window expires (§7.6).              */
    slope_comp_reload_dac_peak();

    /* Clear the HRTIM Timer A repetition interrupt flag */
    /* This is handled by the HAL callback mechanism or direct register clear:
     * HRTIM1->sTimerxRegs[HRTIM_TIMERINDEX_TIMER_A].TIMxICR = HRTIM_TIMISR_REP;
     * The HAL IRQ handler clears it; we just need to implement the callback. */
}

/**
 * regulator_hrtim_fault_isr — HRTIM fault ISR body.
 *
 * Called from HRTIM1_FLT_IRQHandler when FLT1 or FLT2 asserts.
 * The HRTIM hardware has already forced all outputs to their fault state
 * (INACTIVE = LOW → all FETs off).
 *
 * Priority: NVIC_PRIORITY_HRTIM (1).
 * No FreeRTOS API calls allowed.
 */
void regulator_hrtim_fault_isr(void)
{
    /* Determine fault source from HRTIM interrupt status register */
    uint32_t hrtim_isr = HRTIM1->sCommonRegs.ISR;

    RegulatorFaultSource source = REGULATOR_FAULT_NONE;
    if (hrtim_isr & HRTIM_ISR_FLT1)
    {
        source |= REGULATOR_FAULT_HW_FLT1;
    }
    if (hrtim_isr & HRTIM_ISR_FLT2)
    {
        source |= REGULATOR_FAULT_HW_FLT2;
    }

    enter_fault(source);

    /* Clear HRTIM fault flags */
    HRTIM1->sCommonRegs.ICR = (hrtim_isr & (HRTIM_ICR_FLT1C | HRTIM_ICR_FLT2C));
}

/**
 * regulator_pid_tim7_isr — PID computation ISR body.
 *
 * Fires at 20 kHz.  Sequence (§8, §10.2, §15.1):
 *   1. Read ADC measurements (V_out, V_in, I_L, etc.)
 *   2. Update PID coefficients from runtime-mutable variables.
 *   3. Check for integrator reset request (large setpoint change).
 *   4. Run soft-start setpoint ramp if active (§11.2).
 *   5. Run PID computation → new DAC peak value.
 *   6. Update slope compensation step (§7.2).
 *   7. Update telemetry (§15.1).
 *   8. Software safety checks (§10.2); enter fault if violated.
 *   9. Update regulator_ready flag.
 *
 * Priority: NVIC_PRIORITY_PID_TIM7 (2).
 * No FreeRTOS API calls allowed.
 */
void regulator_pid_tim7_isr(void)
{
    if (regulator_state != REGULATOR_STATE_RUNNING)
    {
        return;
    }

    /* --- 1. Trigger and read ADC conversions --- */
    adc_monitor_trigger_vin();

