electricalhog/PD_Charger/STM32CubeIDE/final/Core/Src/regulator.c
    uint32_t v_out_mv  = adc_measurements.v_out_mv;
    uint32_t i_l_ma    = adc_measurements.i_inductor_ma;
    (void)i_l_ma;   /* telemetry only */

    /* Read V_in result from the ADC2 conversion triggered at the start;
     * at 20 kHz period (50 µs), ADC2 conversion (~354 ns) is complete.    */
    adc_monitor_read_vin_result();
    uint32_t v_in_mv = adc_measurements.v_in_mv;

    /* --- 2. Refresh PID config from runtime-mutable variables ---
     * This allows Kp/Ki/Kd to be tuned at runtime without restart (§8.7). */
    pid_config.kp = pid_kp;
    pid_config.ki = pid_ki;
    pid_config.kd = pid_kd;

    /* --- 3. Handle integrator reset request (§8.8) --- */
    if (regulator_integrator_reset_requested)
    {
        pid_reset_integrator(&pid_state);
        regulator_integrator_reset_requested = false;

        /* Re-evaluate operating mode when setpoint changes significantly (§5.1).
         * If the mode changes (buck ↔ boost), reconfigure the HRTIM static
         * and switching legs immediately to prevent shoot-through.            */
        uint32_t voltage_mv = target_voltage_mv;
        RegulatorMode new_mode = determine_mode_from_voltages(v_in_mv, voltage_mv);

        if (new_mode != regulator_mode)
        {
            /* Mode change during RUNNING: reconfigure HRTIM for the new mode.
             * Disable all outputs during the transition to prevent a partial
             * switching state (§5.3, §11.4).                                  */
            hrtim_disable_all_outputs();

            regulator_mode = new_mode;

            /* Reconfigure the static and switching legs for the new mode */
            if (regulator_mode == REGULATOR_MODE_BUCK)
            {
                hrtim_apply_buck_mode_static_leg();
                HAL_HRTIM_WaveformOutputStart(&hhrtim1,
                                               HRTIM_OUTPUT_TA1 | HRTIM_OUTPUT_TA2 |
                                               HRTIM_OUTPUT_TB1 | HRTIM_OUTPUT_TB2);
            }
            else /* BOOST */
            {
                hrtim_apply_boost_mode_static_leg();
                HAL_HRTIM_WaveformOutputStart(&hhrtim1,
                                               HRTIM_OUTPUT_TB1 | HRTIM_OUTPUT_TB2 |
                                               HRTIM_OUTPUT_TA1 | HRTIM_OUTPUT_TA2);
            }

            /* Reset soft-start for the mode transition (§11.4) */
            uint32_t ramp_steps = (uint32_t)SOFT_START_RAMP_MS *
                                  (uint32_t)PID_EXECUTION_RATE_HZ / 1000u;
            if (ramp_steps == 0u) { ramp_steps = 1u; }
            softstart_increment_mv = voltage_mv / ramp_steps;
            if (softstart_increment_mv == 0u) { softstart_increment_mv = 1u; }
            softstart_setpoint_mv = 0u;
            softstart_active      = true;
        }
    }

    /* --- 4. Soft-start setpoint ramp (§11.2) --- */
    uint32_t effective_setpoint_mv;
    if (softstart_active)
    {
        softstart_setpoint_mv += softstart_increment_mv;
        if (softstart_setpoint_mv >= target_voltage_mv)
        {
            softstart_setpoint_mv = target_voltage_mv;
            softstart_active      = false;
        }
        effective_setpoint_mv = softstart_setpoint_mv;
    }
    else
    {
        effective_setpoint_mv = target_voltage_mv;
    }

    /* --- 5. PID computation --- */
    float setpoint_f    = (float)effective_setpoint_mv;
    float measurement_f = (float)v_out_mv;
    float pid_out_f     = pid_update(&pid_state, &pid_config,
                                     setpoint_f, measurement_f);

    uint32_t dac_counts = (uint32_t)pid_out_f;
    if (dac_counts > (uint32_t)PID_OUTPUT_MAX)
    {
        dac_counts = (uint32_t)PID_OUTPUT_MAX;
    }

    /* --- 6. Update slope compensation peak and step --- */
    slope_comp_set_peak(dac_counts);
    slope_comp_update_step(v_out_mv, v_in_mv, (SlopeCompMode)regulator_mode);

    /* --- 7. Update telemetry --- */
    regulator_pid_output_dac_counts = (uint16_t)dac_counts;
    regulator_pid_error_mv          = (int32_t)effective_setpoint_mv - (int32_t)v_out_mv;

    /* --- 8. Software safety checks (§10.2) --- */
    if (!software_safety_checks_pass(v_out_mv, v_in_mv,
                                      effective_setpoint_mv, regulator_mode))
    {
        /* Fault entry handled inside software_safety_checks_pass */
        return;
    }

    /* --- 9. Update regulator_ready flag (§9.1) ---
     * Regulation window: ±2% of setpoint (§9.3).                          */
    if (effective_setpoint_mv > 0u)
    {
        uint32_t tolerance_mv = effective_setpoint_mv / 50u;  /* 2% */
        int32_t error = regulator_pid_error_mv;
        regulator_ready = (error >= -(int32_t)tolerance_mv &&
                           error <=  (int32_t)tolerance_mv);
    }
    else
    {
        regulator_ready = false;
    }
}

/* =========================================================================
 * Internal helper implementations
 * =========================================================================*/

/**
 * hrtim_configure_fault_levels_and_enable — Configure HRTIM fault response.
 *
 * CubeMX sets FaultLevel = NONE for all outputs and FaultEnable = NONE for
 * all timers.  We must correct both to ensure the HRTIM forces all FETs off
 * when FLT1 or FLT2 asserts (§10.1, §5.5).
 *
 * Approach:
 *   a) Reconfigure all four outputs via HAL with FaultLevel = INACTIVE.
 *   b) Enable FLT1 and FLT2 on Timer A and Timer B via direct register bits.
 */
static void hrtim_configure_fault_levels_and_enable(void)
{
    HRTIM_OutputCfgTypeDef output_cfg;
    memset(&output_cfg, 0, sizeof(output_cfg));

    output_cfg.Polarity              = HRTIM_OUTPUTPOLARITY_HIGH;
    output_cfg.IdleMode              = HRTIM_OUTPUTIDLEMODE_NONE;
    output_cfg.IdleLevel             = HRTIM_OUTPUTIDLELEVEL_INACTIVE;
    output_cfg.FaultLevel            = HRTIM_OUTPUTFAULTLEVEL_INACTIVE;
    output_cfg.ChopperModeEnable     = HRTIM_OUTPUTCHOPPERMODE_DISABLED;
    output_cfg.BurstModeEntryDelayed = HRTIM_OUTPUTBURSTMODEENTRY_REGULAR;

    /* Timer A Output 1 (CHA1): buck switching high-side
     * Set = Period reset, Reset = EEV4  (confirmed CubeMX final.ioc)       */
    output_cfg.SetSource   = HRTIM_OUTPUTSET_TIMPER;
    output_cfg.ResetSource = HRTIM_OUTPUTRESET_EEV_4;
    HAL_HRTIM_WaveformOutputConfig(&hhrtim1, HRTIM_TIMERINDEX_TIMER_A,
                                    HRTIM_OUTPUT_TA1, &output_cfg);

    /* Timer A Output 2 (CHA2): complementary low-side, no own Set/Reset */
    output_cfg.SetSource   = HRTIM_OUTPUTSET_NONE;
    output_cfg.ResetSource = HRTIM_OUTPUTRESET_NONE;
    HAL_HRTIM_WaveformOutputConfig(&hhrtim1, HRTIM_TIMERINDEX_TIMER_A,
                                    HRTIM_OUTPUT_TA2, &output_cfg);

