electricalhog/PD_Charger/STM32CubeIDE/final/Core/Src/regulator.c
    /* Timer B Output 1 (CHB1): boost switching high-side
     * Set = EEV4, Reset = Period  (Dan IOC update v0.1.2i, §5.5)           */
    output_cfg.SetSource   = HRTIM_OUTPUTSET_EEV_4;
    output_cfg.ResetSource = HRTIM_OUTPUTRESET_TIMPER;
    HAL_HRTIM_WaveformOutputConfig(&hhrtim1, HRTIM_TIMERINDEX_TIMER_B,
                                    HRTIM_OUTPUT_TB1, &output_cfg);

    /* Timer B Output 2 (CHB2): complementary low-side */
    output_cfg.SetSource   = HRTIM_OUTPUTSET_NONE;
    output_cfg.ResetSource = HRTIM_OUTPUTRESET_NONE;
    HAL_HRTIM_WaveformOutputConfig(&hhrtim1, HRTIM_TIMERINDEX_TIMER_B,
                                    HRTIM_OUTPUT_TB2, &output_cfg);

    /* Enable FLT1 and FLT2 response on Timer A and Timer B.
     * RM0440 §27.5.2: TIMxCR bits 20 (FLT1EN) and 21 (FLT2EN).           */
    HRTIM1->sTimerxRegs[HRTIM_TIMERINDEX_TIMER_A].TIMxCR |=
        (HRTIM_TIMCR_FLT1EN_BIT | HRTIM_TIMCR_FLT2EN_BIT);
    HRTIM1->sTimerxRegs[HRTIM_TIMERINDEX_TIMER_B].TIMxCR |=
        (HRTIM_TIMCR_FLT1EN_BIT | HRTIM_TIMCR_FLT2EN_BIT);
}

/**
 * hrtim_configure_backstop_compare1 — Set Compare 1 backstop registers (§10.3).
 *
 * Compare 1 fires at MAX_ON_TIME_COUNTS within each period.
 * For buck mode (Timer A active): CMP1 resets CHA1 (RST1R |= CMP1).
 * For boost mode (Timer B active): CMP1 sets CHB1 (SET1R |= CMP1).
 * Both are OR'd in so the pre-configured EEV4 behaviour is preserved.
 *
 * NOTE: CubeMX configures CompareUnit1 as __NULL (§10.3 CubeMX update note).
 * The compare value is written directly here.
 */
static void hrtim_configure_backstop_compare1(void)
{
    /* Set Compare 1 value on both timers */
    HRTIM1->sTimerxRegs[HRTIM_TIMERINDEX_TIMER_A].CMP1xR = MAX_ON_TIME_COUNTS;
    HRTIM1->sTimerxRegs[HRTIM_TIMERINDEX_TIMER_B].CMP1xR = MAX_ON_TIME_COUNTS;

    /* Timer A (buck active leg): add CMP1 as additional Reset source for TA1.
     * RST1R already has EEV4; OR in CMP1 so either event ends the charge phase.
     * HRTIM_RST1R_CMP1 = bit 4 (RM0440 Table 313).                         */
    HRTIM1->sTimerxRegs[HRTIM_TIMERINDEX_TIMER_A].RSTx1R |= HRTIM_RST1R_CMP1;

    /* Timer B (boost active leg): add CMP1 as additional Set source for TB1.
     * SET1R already has EEV4; OR in CMP1 so either event ends the charge phase
     * by transitioning CHB1 from LOW to HIGH.                               */
    HRTIM1->sTimerxRegs[HRTIM_TIMERINDEX_TIMER_B].SETx1R |= HRTIM_SET1R_CMP1;

    /* TODO(hardware): Verify CMP1 fires correctly at MAX_ON_TIME_COUNTS
     * by observing the switching waveform with an oscilloscope.  With a
     * constant DAC threshold above I_L, the charge phase should not reach
     * CMP1 in normal operation.                                              */
}

/**
 * hrtim_enable_period_and_fault_interrupts — Enable HRTIM interrupts.
 *
 * Timer A repetition interrupt → DAC Y-intercept reload at each period (§7.6).
 * Fault interrupt → hardware fault handling (§10.1).
 *
 * Both at NVIC priority NVIC_PRIORITY_HRTIM (1).
 */
static void hrtim_enable_period_and_fault_interrupts(void)
{
    /* Enable Timer A repetition (period) interrupt */
    __HAL_HRTIM_TIMER_ENABLE_IT(&hhrtim1, HRTIM_TIMERINDEX_TIMER_A,
                                  HRTIM_TIM_IT_REP);
    HAL_NVIC_SetPriority(HRTIM1_TIMA_IRQn, NVIC_PRIORITY_HRTIM, 0u);
    HAL_NVIC_EnableIRQ(HRTIM1_TIMA_IRQn);

    /* Enable HRTIM fault interrupt */
    __HAL_HRTIM_ENABLE_IT(&hhrtim1, HRTIM_IT_FLT1);
    __HAL_HRTIM_ENABLE_IT(&hhrtim1, HRTIM_IT_FLT2);
    HAL_NVIC_SetPriority(HRTIM1_FLT_IRQn, NVIC_PRIORITY_HRTIM, 0u);
    HAL_NVIC_EnableIRQ(HRTIM1_FLT_IRQn);
}

/**
 * hrtim_start_timers — Start HRTIM counters (outputs remain disabled).
 *
 * Both Timer A and Timer B must be running for their compare and period
 * events to fire.  Outputs are enabled separately in regulator_start().
 */
static void hrtim_start_timers(void)
{
    /* Start Timer A and Timer B counters.
     * HAL_HRTIM_WaveformCounterStart_IT enables the timer with interrupts. */
    HAL_HRTIM_WaveformCounterStart_IT(&hhrtim1,
                                       HRTIM_TIMERID_TIMER_A | HRTIM_TIMERID_TIMER_B);
}

/**
 * hrtim_apply_buck_mode_static_leg — Force Timer B outputs for static leg.
 *
 * In buck mode, Timer B (output side) must hold CHB1 HIGH continuously.
 * Mechanism (§5.5):
 *   - Clear RST1R (no reset events) so nothing drives CHB1 LOW.
 *   - Write SST (software-set, self-clearing) to SET1R to force CHB1 HIGH.
 *   - Since nothing can reset it after SST fires, CHB1 stays HIGH.
 *
 * NOTE: This clears the EEV4+CMP1 set sources we configured in
 * hrtim_configure_fault_levels_and_enable.  We must restore them when
 * transitioning to boost mode.  TODO: Document register restore in mode
 * transition code.
 */
static void hrtim_apply_buck_mode_static_leg(void)
{
    /* Restore Timer A (input side) switching configuration.
     * When transitioning from boost mode, Timer A's RSTx1R was cleared
     * (it was used as the static leg in boost mode).  Restore it here
     * so Timer A can switch in buck mode.
     * If this is the initial call (from regulator_init), these registers
     * already hold the values from hrtim_configure_fault_levels_and_enable
     * + hrtim_configure_backstop_compare1, so OR'ing them in is idempotent.  */
    HRTIM1->sTimerxRegs[HRTIM_TIMERINDEX_TIMER_A].SETx1R =
        HRTIM_OUTPUTSET_TIMPER;
    HRTIM1->sTimerxRegs[HRTIM_TIMERINDEX_TIMER_A].RSTx1R =
        HRTIM_OUTPUTRESET_EEV_4 | HRTIM_RST1R_CMP1;

    /* Configure Timer B (output side) as static HIGH leg.
     *
     * TODO(hardware): The mechanism below uses SST (software-set, self-
     * clearing) which forces CHB1 HIGH immediately.  Since RST1R is cleared,
     * CHB1 will remain HIGH.  However, clearing RST1R removes the Period
     * reset event needed for boost mode.  The mode transition sequence must
     * restore RST1R = HRTIM_OUTPUTRESET_TIMPER | CMP1 when switching to boost.
     *
     * An alternative is to keep the EEV4 set source active but effectively
     * idle (DAC at max so COMP1 never fires in buck static leg mode).
     * For v0.1.2 bring-up, the SST mechanism is the simplest approach.      */

    /* Clear all reset sources for TB1 (nothing will drive CHB1 LOW) */
    HRTIM1->sTimerxRegs[HRTIM_TIMERINDEX_TIMER_B].RSTx1R = 0u;

    /* Fire SST to force CHB1 HIGH immediately.
     * SST is self-clearing; the output holds HIGH because RST1R = 0.        */
    HRTIM1->sTimerxRegs[HRTIM_TIMERINDEX_TIMER_B].SETx1R = HRTIM_SET1R_SST;
}

/**
 * hrtim_apply_boost_mode_static_leg — Force Timer A outputs for static leg.
 *
 * In boost mode, Timer A (input side) must hold CHA1 HIGH continuously,
 * except during the bootstrap refresh pulse at the start of each period.
 *
 * Static forcing mechanism is the same as for buck mode:
 *   - Clear RST1R (no reset events for TA1).
 *   - Fire SST on SET1R to force CHA1 HIGH immediately.
 *
 * Bootstrap refresh (§5.4 boost mode):
 *   At the period reset, CHA1 must briefly go LOW for ≥200 ns.
 *   TODO(hardware): Implement bootstrap refresh for Timer A in boost mode.
 *   Options:
 *     a) HRTIM output compare at t=0 to t=REFRESH_TICKS to drive CHA1 LOW,
 *        then re-assert SST after REFRESH_TICKS.
 *     b) Use HRTIM period ISR to momentarily drive CHA1 LOW via direct
 *        register write (HRTIM forced-inactive via RST1R SST equivalent).
 *     c) Use an additional compare unit to generate a short LOW pulse.
 *   For v0.1.2 initial bring-up, the bootstrap refresh is left as a TODO.
 *   The bootstrap cap hold time is ~10 µs; at 200 kHz (5 µs period), the
 *   bootstrap may drain before the first refresh.  Monitor this during
 *   bring-up and implement if UV lockout is observed.
 */
static void hrtim_apply_boost_mode_static_leg(void)
{
    /* Clear all reset sources for TA1 */
    HRTIM1->sTimerxRegs[HRTIM_TIMERINDEX_TIMER_A].RSTx1R = 0u;

    /* Fire SST to force CHA1 HIGH */
    HRTIM1->sTimerxRegs[HRTIM_TIMERINDEX_TIMER_A].SETx1R = HRTIM_SET1R_SST;

    /* Restore boost switching sources for Timer B
     * (cleared in hrtim_apply_buck_mode_static_leg if previously in buck mode) */
    HRTIM1->sTimerxRegs[HRTIM_TIMERINDEX_TIMER_B].RSTx1R =
        HRTIM_OUTPUTRESET_TIMPER | HRTIM_RST1R_CMP1;
    HRTIM1->sTimerxRegs[HRTIM_TIMERINDEX_TIMER_B].SETx1R =
        HRTIM_OUTPUTSET_EEV_4 | HRTIM_SET1R_CMP1;
}

/**
 * hrtim_disable_all_outputs — Disable all HRTIM outputs immediately.
 *
 * All FETs go to their idle/fault state (INACTIVE = LOW).
 * Used in regulator_stop() and enter_fault().
 */
static void hrtim_disable_all_outputs(void)
{
    HAL_HRTIM_WaveformOutputStop(&hhrtim1,
                                  HRTIM_OUTPUT_TA1 | HRTIM_OUTPUT_TA2 |
                                  HRTIM_OUTPUT_TB1 | HRTIM_OUTPUT_TB2);
}

/**
 * power_path_enable — Assert INPUT_EN and OUTPUT_EN GPIOs.
 */
static void power_path_enable(void)
{
    HAL_GPIO_WritePin(PIN_INPUT_EN_PORT,  PIN_INPUT_EN_PIN,  GPIO_PIN_SET);
    HAL_GPIO_WritePin(PIN_OUTPUT_EN_PORT, PIN_OUTPUT_EN_PIN, GPIO_PIN_SET);
    HAL_GPIO_WritePin(PIN_OUTPUT_DIS_PORT,PIN_OUTPUT_DIS_PIN,GPIO_PIN_RESET);
}

/**
 * power_path_disable — Deassert INPUT_EN and OUTPUT_EN GPIOs.
 */
static void power_path_disable(void)
{
    HAL_GPIO_WritePin(PIN_INPUT_EN_PORT,  PIN_INPUT_EN_PIN,  GPIO_PIN_RESET);
    HAL_GPIO_WritePin(PIN_OUTPUT_EN_PORT, PIN_OUTPUT_EN_PIN, GPIO_PIN_RESET);
    HAL_GPIO_WritePin(PIN_OUTPUT_DIS_PORT,PIN_OUTPUT_DIS_PIN,GPIO_PIN_SET); // discharge VBUS
}

/**
 * determine_mode_from_voltages — Select buck or boost based on V_in vs
 * V_setpoint with hysteresis (§5.1).
 *
 * @param v_in_mv       Measured input voltage in millivolts.
 * @param v_setpoint_mv Target output voltage in millivolts.
 * @return REGULATOR_MODE_BUCK or REGULATOR_MODE_BOOST.
 */
static RegulatorMode determine_mode_from_voltages(uint32_t v_in_mv,
                                                   uint32_t v_setpoint_mv)
{
    if (v_in_mv > (v_setpoint_mv + MODE_HYSTERESIS_MV))
    {
        return REGULATOR_MODE_BUCK;
    }
    else if (v_setpoint_mv > (v_in_mv + MODE_HYSTERESIS_MV))
    {
        return REGULATOR_MODE_BOOST;
    }
    else
    {
        /* Within hysteresis band — maintain current mode (§5.1) */
        return regulator_mode;
    }
}

/**
 * enter_fault — Transition to FAULT state from any context.
 *
 * Safe to call from ISR (no FreeRTOS API).
 *
 * @param source  Bitmask of fault source(s).
 */
static void enter_fault(RegulatorFaultSource source)
{
    /* Record fault source FIRST before disabling outputs */
    regulator_last_fault_source = source;

    /* Disable switching outputs (belt-and-suspenders: hardware fault logic
     * already forces them to INACTIVE, but also do it in software)          */
    hrtim_disable_all_outputs();

    /* Zero DAC — comparator threshold = 0 → additional safety (§4.4) */
    DAC3->DHR12R1 = 0u;

    /* Stop timers */
    TIM6->CR1 &= ~TIM_CR1_CEN;   /* stop TIM6 (slope comp) */
    TIM7->CR1 &= ~TIM_CR1_CEN;   /* stop TIM7 (PID)        */

    /* Update shared state for PD stack */
    regulator_fault  = true;
    regulator_ready  = false;

    regulator_state  = REGULATOR_STATE_FAULT;
}

/**
 * software_safety_checks_pass — Check all software safety conditions (§10.2).
 *
 * Returns true if all conditions are within bounds.
 * Returns false and calls enter_fault() if any condition is violated.
 */
static bool software_safety_checks_pass(uint32_t v_out_mv,
                                         uint32_t v_in_mv,
                                         uint32_t v_setpoint_mv,
                                         RegulatorMode mode)
{
    /* --- 1. Absolute OVP (§10.2) --- */
    if (v_out_mv > OVP_ABSOLUTE_MV)
    {
        enter_fault(REGULATOR_FAULT_SW_OVP);
        return false;
    }

    /* --- 2. Relative OVP --- */
    if (v_setpoint_mv > 0u)
    {
        uint32_t ovp_threshold = (v_setpoint_mv * OVP_RELATIVE_PCT) / 100u;
        if (v_out_mv > ovp_threshold)
        {
            enter_fault(REGULATOR_FAULT_SW_OVP);
            return false;
        }

        /* --- 3. Relative UVP (only when not in soft-start) --- */
        if (!softstart_active)
        {
            uint32_t uvp_threshold = (v_setpoint_mv * UVP_RELATIVE_PCT) / 100u;
            if (v_out_mv < uvp_threshold)
            {
                enter_fault(REGULATOR_FAULT_SW_UVP);
                return false;
            }
        }
    }

    /* --- 4. V_in range check (§10.2) --- */
    if (mode == REGULATOR_MODE_BUCK)
    {
        /* Buck requires V_in > V_out + margin */
        if (v_in_mv < (v_setpoint_mv + BUCK_VIN_MARGIN_MV))
        {
            enter_fault(REGULATOR_FAULT_SW_VIN_RANGE);
            return false;
        }
    }
    else /* BOOST */
    {
        /* Boost requires V_in < V_out - margin */
        if (v_setpoint_mv > BOOST_VIN_MARGIN_MV &&
            v_in_mv > (v_setpoint_mv - BOOST_VIN_MARGIN_MV))
        {
            enter_fault(REGULATOR_FAULT_SW_VIN_RANGE);
            return false;
        }
    }

    return true;
}
